---
kind: type
id: T:Autodesk.Revit.DB.FaceSilhouetteNode
source: html/7f6dab2d-6285-1027-9b4a-39d773002442.htm
---
# Autodesk.Revit.DB.FaceSilhouetteNode

An output node that represents a Face edge.

## Syntax (C#)
```csharp
public class FaceSilhouetteNode : FaceDetailNode
```

## Remarks
See also: OnFaceSilhouette2D(FaceSilhouetteNode) .